; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s6-p11-a4)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 l4-0 l4-1 l4-2 l4-3 l4-4 l4-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l4-5)
    (in-city  l4-5 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (at t0 l0-4)
    (at t1 l1-2)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l4-3)
    (at p0 l4-0)
    (at p1 l3-3)
    (at p2 l1-0)
    (at p3 l1-4)
    (at p4 l4-4)
    (at p5 l1-2)
    (at p6 l2-4)
    (at p7 l2-0)
    (at p8 l0-3)
    (at p9 l0-5)
    (at p10 l0-2)
    (at a0 l2-0)
    (at a1 l0-0)
    (at a2 l0-0)
    (at a3 l4-0)
)
(:goal
    (and
        (at p0 l1-1)
        (at p1 l1-0)
        (at p2 l1-5)
        (at p3 l3-3)
        (at p4 l0-4)
        (at p5 l0-4)
        (at p6 l2-1)
        (at p7 l4-0)
        (at p8 l2-0)
        (at p9 l0-2)
        (at p10 l3-3)
    )
)

  (:constraints
    (and
      (always (not (in p2 a0)))
      (always (not (in p2 a1)))
      (always (not (in p2 a2)))
      (always (not (in p2 a3)))
      (always (not (in p6 a0)))
      (always (not (in p6 a1)))
      (always (not (in p6 a2)))
      (always (not (in p6 a3)))
      (always (not (in p9 a0)))
      (always (not (in p9 a1)))
      (always (not (in p9 a2)))
      (always (not (in p9 a3)))
    )
  )
)

; plan
1. (fly-airplane a3 l4-0 l1-0)
   deleted: (at a3 l4-0)
   added: (at a3 l1-0)
   goals met: 0 of 11
2. (drive-truck t4 l4-3 l4-4 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-4)
   goals met: 0 of 11
3. (drive-truck t2 l2-0 l2-4 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-4)
   goals met: 0 of 11
4. (load-airplane p7 a0 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 a0)
   goals met: 0 of 11
5. (load-truck p5 t1 l1-2)
   deleted: (at p5 l1-2)
   added: (in p5 t1)
   goals met: 0 of 11
6. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 0 of 11
7. (drive-truck t0 l0-4 l0-5 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-5)
   goals met: 0 of 11
8. (fly-airplane a2 l0-0 l4-0)
   deleted: (at a2 l0-0)
   added: (at a2 l4-0)
   goals met: 0 of 11
9. (drive-truck t1 l1-2 l1-5 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-5)
   goals met: 0 of 11
10. (load-truck p4 t4 l4-4)
   deleted: (at p4 l4-4)
   added: (in p4 t4)
   goals met: 0 of 11
11. (load-truck p6 t2 l2-4)
   deleted: (at p6 l2-4)
   added: (in p6 t2)
   goals met: 0 of 11
12. (load-truck p1 t3 l3-3)
   deleted: (at p1 l3-3)
   added: (in p1 t3)
   goals met: 0 of 11
13. (load-truck p9 t0 l0-5)
   deleted: (at p9 l0-5)
   added: (in p9 t0)
   goals met: 0 of 11
14. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 0 of 11
15. (load-airplane p0 a2 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 a2)
   goals met: 0 of 11
16. (drive-truck t4 l4-4 l4-0 c4)
   deleted: (at t4 l4-4)
   added: (at t4 l4-0)
   goals met: 0 of 11
17. (drive-truck t2 l2-4 l2-1 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-1)
   goals met: 0 of 11
18. (drive-truck t0 l0-5 l0-3 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-3)
   goals met: 0 of 11
19. (drive-truck t3 l3-3 l3-0 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-0)
   goals met: 0 of 11
20. (drive-truck t1 l1-5 l1-4 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-4)
   goals met: 0 of 11
21. (unload-truck p4 t4 l4-0)
   deleted: (in p4 t4)
   added: (at p4 l4-0)
   goals met: 0 of 11
22. (unload-truck p6 t2 l2-1)
   deleted: (in p6 t2)
   added: (at p6 l2-1)
   goals met: 1 of 11
23. (load-truck p8 t0 l0-3)
   deleted: (at p8 l0-3)
   added: (in p8 t0)
   goals met: 1 of 11
24. (unload-truck p1 t3 l3-0)
   deleted: (in p1 t3)
   added: (at p1 l3-0)
   goals met: 1 of 11
25. (load-truck p3 t1 l1-4)
   deleted: (at p3 l1-4)
   added: (in p3 t1)
   goals met: 1 of 11
26. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 1 of 11
27. (drive-truck t1 l1-4 l1-5 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-5)
   goals met: 1 of 11
28. (load-airplane p4 a2 l4-0)
   deleted: (at p4 l4-0)
   added: (in p4 a2)
   goals met: 1 of 11
29. (unload-truck p9 t0 l0-2)
   deleted: (in p9 t0)
   added: (at p9 l0-2)
   goals met: 2 of 11
30. (load-truck p10 t0 l0-2)
   deleted: (at p10 l0-2)
   added: (in p10 t0)
   goals met: 2 of 11
31. (drive-truck t1 l1-5 l1-0 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-0)
   goals met: 2 of 11
32. (fly-airplane a2 l4-0 l1-0)
   deleted: (at a2 l4-0)
   added: (at a2 l1-0)
   goals met: 2 of 11
33. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 2 of 11
34. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 2 of 11
35. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 2 of 11
36. (load-truck p2 t1 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t1)
   goals met: 2 of 11
37. (unload-airplane p0 a2 l1-0)
   deleted: (in p0 a2)
   added: (at p0 l1-0)
   goals met: 2 of 11
38. (unload-truck p8 t0 l0-0)
   deleted: (in p8 t0)
   added: (at p8 l0-0)
   goals met: 2 of 11
39. (unload-truck p10 t0 l0-0)
   deleted: (in p10 t0)
   added: (at p10 l0-0)
   goals met: 2 of 11
40. (drive-truck t1 l1-0 l1-5 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-5)
   goals met: 2 of 11
41. (fly-airplane a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 2 of 11
42. (load-airplane p5 a3 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a3)
   goals met: 2 of 11
43. (load-airplane p3 a3 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a3)
   goals met: 2 of 11
44. (unload-truck p2 t1 l1-5)
   deleted: (in p2 t1)
   added: (at p2 l1-5)
   goals met: 3 of 11
45. (load-airplane p8 a0 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 a0)
   goals met: 3 of 11
46. (load-airplane p10 a1 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a1)
   goals met: 3 of 11
47. (unload-airplane p4 a2 l0-0)
   deleted: (in p4 a2)
   added: (at p4 l0-0)
   goals met: 3 of 11
48. (fly-airplane a3 l1-0 l3-0)
   deleted: (at a3 l1-0)
   added: (at a3 l3-0)
   goals met: 3 of 11
49. (fly-airplane a1 l0-0 l3-0)
   deleted: (at a1 l0-0)
   added: (at a1 l3-0)
   goals met: 3 of 11
50. (unload-airplane p3 a3 l3-0)
   deleted: (in p3 a3)
   added: (at p3 l3-0)
   goals met: 3 of 11
51. (load-airplane p1 a3 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 a3)
   goals met: 3 of 11
52. (drive-truck t1 l1-5 l1-1 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-1)
   goals met: 3 of 11
53. (fly-airplane a0 l0-0 l4-0)
   deleted: (at a0 l0-0)
   added: (at a0 l4-0)
   goals met: 3 of 11
54. (unload-airplane p10 a1 l3-0)
   deleted: (in p10 a1)
   added: (at p10 l3-0)
   goals met: 3 of 11
55. (unload-airplane p7 a0 l4-0)
   deleted: (in p7 a0)
   added: (at p7 l4-0)
   goals met: 4 of 11
56. (fly-airplane a3 l3-0 l1-0)
   deleted: (at a3 l3-0)
   added: (at a3 l1-0)
   goals met: 4 of 11
57. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 4 of 11
58. (fly-airplane a0 l4-0 l2-0)
   deleted: (at a0 l4-0)
   added: (at a0 l2-0)
   goals met: 4 of 11
59. (load-truck p10 t3 l3-0)
   deleted: (at p10 l3-0)
   added: (in p10 t3)
   goals met: 4 of 11
60. (load-truck p3 t3 l3-0)
   deleted: (at p3 l3-0)
   added: (in p3 t3)
   goals met: 4 of 11
61. (unload-airplane p1 a3 l1-0)
   deleted: (in p1 a3)
   added: (at p1 l1-0)
   goals met: 5 of 11
62. (load-truck p0 t1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t1)
   goals met: 5 of 11
63. (unload-airplane p8 a0 l2-0)
   deleted: (in p8 a0)
   added: (at p8 l2-0)
   goals met: 6 of 11
64. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 6 of 11
65. (fly-airplane a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 6 of 11
66. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 6 of 11
67. (unload-truck p3 t3 l3-3)
   deleted: (in p3 t3)
   added: (at p3 l3-3)
   goals met: 7 of 11
68. (unload-truck p10 t3 l3-3)
   deleted: (in p10 t3)
   added: (at p10 l3-3)
   goals met: 8 of 11
69. (unload-airplane p5 a3 l0-0)
   deleted: (in p5 a3)
   added: (at p5 l0-0)
   goals met: 8 of 11
70. (unload-truck p0 t1 l1-1)
   deleted: (in p0 t1)
   added: (at p0 l1-1)
   goals met: 9 of 11
71. (load-truck p4 t0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 t0)
   goals met: 9 of 11
72. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 9 of 11
73. (drive-truck t0 l0-0 l0-4 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-4)
   goals met: 9 of 11
74. (unload-truck p5 t0 l0-4)
   deleted: (in p5 t0)
   added: (at p5 l0-4)
   goals met: 10 of 11
75. (unload-truck p4 t0 l0-4)
   deleted: (in p4 t0)
   added: (at p4 l0-4)
   goals met: 11 of 11
